Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/education/primary_and_post_primary_education/going_to_primary_school/curriculum_in_national_schools.html.txt.tmx
Source language: en
Languages: ga

source: Curriculum in primary schools
ga: An curaclam sna bunscoileanna

source: Under the Education Act 1998, the Minister for Education and Skills may set down the curriculum for recognised schools
ga: De réir an Achta Oideachais 1998, is féidir leis an Aire Oideachais agus Scileanna an curaclam a leagadh síos do scoileanna aitheanta

source: The National Council for Curriculum and Assessment is a statutory body, whose function is to advise the Minister of Education and Skills in matters relating to the curriculum for early childhood education, primary and post-primary schools, and the assessment procedures employed in schools and examinations on subjects that are part of the curriculum
ga: Is comhlacht reachtúil í an Chomhairle Náisiúnta Curaclaim agus Measúnachta. Tá sé mar dhualgas aici comhairle a thabhairt don Aire Oideachais agus Scileanna maidir le cúrsaí luathoideachais, bunscoileanna agus iarbhunscoileanna, agus na modhanna measúnachta a úsáidtear i scoileanna agus scrúdaithe, ar ábhair gur cuid den churaclam iad

source: This includes the subjects to be offered, the syllabus for each subject and the guidance and counselling provision to be offered
ga: Cuirtear san áireamh na hábhair a bheidh ar fáil, siollabas do gach ábhair agus an treoir agus an chomhairle a chuirfear ar fáil

source: Under the Education Act 1998 the Minister:
ga: De réir An Achta um Oideachais, 1998, caithfidh an tAire:

source: • Must take into account the desirability of helping schools to provide other subjects that the Board of Management thinks are appropriate
ga: • A chinntiú go mbeidh cabhair ar fáil do scoileanna chun ábhair eile a chur ar fáil a bheadh oiriúnach de réir an Bhoird Bainistíochta

source: • Must take into account the ethos of the school
ga: • Spiorad na scoile a chur san áireamh

source: • Can give directions to schools to ensure that the subjects and syllabuses are appropriate and relevant to the educational and vocational needs of those schools
ga: • Treoracha a thabhairt do scoileanna chun a chinntiú go bhfuil na hábhair agus na siollabais oiriúnacha ann agus go mbaineann siad le riachtanais oideachasúla agus gairmiúla na scoileanna sin

source: • Must ensure that the amount of instruction time given to curriculum subjects is sufficient to allow for reasonable instruction in subjects that are related to the ethos of the school
ga: • A chinntiú go gcaitear dóthain ama le hábhair an curaclaim ach fós go mbeidh teagasc réasúnta ar fáil sna hábhair a bhaineann le spiorad na scoile

source: • Must not force any student to attend classes in any subject that clashes with the beliefs of the parents
ga: • A bheith cinnte de nach gcuirfí brú ar mac léinn ar bith freastal ar ranganna in aon ábhar ar leith nach gcreideann na tuismitheoirí iontu

source: The revised primary school curriculum was introduced into national schools in 1999
ga: Tugadh isteach curaclam athbhreithnithe sna scoileanna náisiúnta faoi 1999

source: It consists of 6 curriculum areas that are further divided into 11 subjects
ga: Tá sé chuid sa churaclam bunscoile atá roinnte arís i 11 ábhar

source: • Language: Gaeilge (pdf), English (pdf)
ga: • Teanga: (Gaeilge (pdf), Béarla (pdf));

source: • Social, Environmental and Scientific Education: History (pdf), Geography (pdf), Science (pdf)
ga: • Oideachas Sóisialta, Comhshaoil agus Eolaíochta: (Stair (pdf), Tíreolaíocht (pdf), Eolaíocht (pdf)),

source: • Arts Education: Music (pdf), Visual Arts (pdf), Drama (pdf)
ga: • Oideachas Ealaíona: (Ceol (pdf), Amharcealaíona (pdf), Drámaíocht (pdf));

source: • Social Personal and Health Education: Social, Personal and Health Education (pdf)
ga: • Oideachas Sóisialta, Pearsanta agus Sláinte: (Oideachas Sóisialta, Pearsanta agus Sláinte (pdf))

source: There are guidelines on the time to be allocated to each of the curriculum areas
ga: Tá treoirlínte ann a léiríonn an méid ama a leagtar amach do gach chuid den churaclam

source: The aims of the curriculum are to ensure that all children are provided with learning opportunities that recognise and celebrate their uniqueness, develop their full potential
ga: Is iad aidhmeanna an churaclaim ná a chinntiú go mbeadh deiseanna foghlama ag gach páiste a aithníonn agus a cheiliúrann uathúlacht ar leith an pháiste aonair agus a gcumas iomlán a fhorbairt

source: The focus is on the child as learner, and the use of a variety of teaching methodologies is an essential feature of the curriculum
ga: Cuirtear an bhćim ar an bpáiste mar fhoghlaimeoir, agus is cuid an-tábhachtach den churaclam é na modhanna múinte éagsúla a úsáidtear

source: The curriculum emphasises the need for greater attention to be paid to students with special educational needs and emphasises the importance of achieving functional literacy and numeracy
ga: Cuirtear béim sa churaclam ar cé chomh tábhachtach is atá sé aire a dhíriú ar mhic léinn le riachtanais oideachasúla speisialta agus go mbeadh litearthacht feidhmiúil agus uimhearthacht feidhmiúil ag na daoine sin

source: It also draws attention to the needs of gifted children
ga: Dírítear aire freisin ar na riachtanais a bhíonn ag páistí tréitheacha

source: Under Article 22 of the Education Act schools are obliged to "regularly evaluate students and periodically report the results of the evaluation to the students and their parents"
ga: Tá dualgas ar scoileanna faoi Alt 22 den Acht Oideachais chun 'meastóireacht rialta ar mhic léinn agus tuairisc faoi thorthaí na meastóireachta a thabhairt go tréimhsiúil do na mic léinn agus dá dtuismitheoirí'

source: In general children's learning and achievement are regularly assessed in primary schools using a variety of tests and other methods
ga: Go ginearálta, déantar foghlaim agus gnóthachtáil leanaí a mheasúnú go rialta i mbunscoileanna, ag baint leasa as tástálacha éagsúla agus modhanna eile

source: Circular 0138/2006 Supporting Assessment in Primary School, states how assessment should carried out
ga: Sonraíonn imlitir na Roinne Oideachais agus Scileanna 0138/2006 Supporting Assessment in Primary School conas measúnú a chomhlíonadh

source: From 2007 all Irish primary schools must administer standardised tests in English and mathematics to their pupils twice during their primary school years as follows:
ga: Caithfidh gach bunscoil tástálacha caighdeánaithe a riaradh sa Bhéarla agus matamaitic ar a gcuid daltaí faoi dhó le linn na mblianta bunscoile mar a leanas:

source: • At the end of first class or at the beginning of second class and
ga: • Ag deireadh rang a haon nó ag tús rang a dó agus

source: • At the end of fourth class or at the beginning of fifth class
ga: • Ag deireadh rang a ceathair nó ag tús rang a cúig

source: The National Council for Curriculum and Assessment has published Assessment in the Primary School Curriculum: Guidelines for Schools (pdf)
ga: Tá Measúnú sa Churaclam Bunscoile: Treoirlínte do Scoileanna (pdf) foilsithe ag an gComhairle Náisiúnta Curaclaim agus Measúnachta

source: It has also published explanatory leaflets for parents about the standardised tests
ga: Tá bileoga mínithe do thuismitheoirí faoi thástálacha caighdeánaithe foilsithe acu chomh maith

source: The National Council for Curriculum and Assessment (NCCA) provides information for parents that provides an outline of the broad content and emphases in the curriculum, as well as advice on how parents can support teaching and learning at home and in school
ga: Tá leabhrán eolais ullmhaithe do thuismitheoirí ag an Chomhairle Náisiúnta Curaclaim agus Measúnachta (CNCM) a léiríonn an t-ábhar ginearálta agus an bhéim sa churaclam, chomh maith le comhairle ar conas is féidir le tuismitheoirí tacaíocht a thabhairt don mhúinteoireacht agus don bhfoghlaim sa bhaile agus ar scoil

source: Support for the Primary School Curriculum Programme
ga: Tacaíocht do Chlár An Churaclaim Bunscoile

source: National Council for Curriculum and Assessment
ga: An Chomhairle Náisiúnta Curaclaim agus Measúnachta

source: The National Council for Curriculum and Assessment was established as a statutory body in July 2001. Its function is to advise the Minister of Education and Skills in matters relating to the curriculum for early childhood education, primary and post-primary schools, and the assessment procedures employed in schools and examinations on subjects that are part of the curriculum
ga: Bunaíodh An Chomhairle Náisiúnta Curaclaim agus Measúnachta mar chomhlacht reachtúil i 2001, chun comhairle a thabhairt don Aire Oideachais agus Scileanna maidir le cúrsaí luathoideachais, bunscoileanna agus iarbhunscoileanna, agus na modhanna measúnachta a úsáidtear i scoileanna agus scrúdaithe, ar ábhair gur cuid den churaclam iad

source: The Professional Development Service for Teachers (PDST) in primary schools includes and develops the work of the former Primary Curriculum Support Programme (PCSP) and School Development Planning Support (SDPS)
ga: Déanann an tSeirbhís um Fhorbairt Ghairmiúil do bhunscoileanna comhchuimsiú agus forbairt ar an obair a bhí ar bun cheana ag an tSeirbhís Tacaíochta don Churaclam Bunscoile (STCB) agus ag an Tacaíocht Pleanála um Fhorbairt Scoileanna (TPFS)

source: PPDS advisors work with schools supporting individual teachers, groups of teachers and whole staffs in implementation of the primary school curriculum and in organisational and development planning
ga: Is é móraidhm na seirbhíse ná tacú le scoileanna a fhorbairt mar phobail ghairmiúla ina mbíonn forbairt ghairmiúil na múinteoirí ceangailte go dlúth le forbairt scoile agus le feabhsú ar dhul chun cinn daltaí

source: Planning is a statutory requirement for schools under Section 21 of the Education Act 1998
ga: Is riachtanas reachtúil é pleanáil do scoileanna de réir ailt 21 den Acht Oideachais 1998

source: Every school is required to have a school plan and the boards of management are given responsibility for ensuring that the plan is prepared, reviewed and regularly updated
ga: Caithfear plean scoile a bheith i ngach scoil agus tá sé de dhualgas ar na boird bhainistíochta féachaint chuige go ndéantar an plean a ullmhú, a athbhreithnú agus a nuashonrú go rialta

source: A school plan deals with the curriculum and with the organisation of all the school's resources, including staff, space, facilities, equipment, time and finance
ga: Sa phlean scoile, bíonn cur síos ar chúrsaí churaclaim agus ar gach a bhaineann le hacmhainní na scoile, ag cur san áireamh an fhoireann, spás, áiseanna, fearas, am agus airgeadas

source: It also includes the school's policies on a range of administrative and organisational issues and, where appropriate, the school's strategies for implementing official guidelines and regulations
ga: Cuirtear san áireamh freisin polasaithe na scoile, polasaithe riaracháin agus polasaithe eagraíochta, agus más iondúil é, straitéisí na scoile chun treoirlínte agus rialacha a chur i gcrích

source: Information about school development planning in primary schools is available from the Primary Professional Development Service - see 'Where to apply' below
ga: Dúnadh an tAonad i Lúnasa 2008. Tá tuilleadh eolais faoi phleanáil forbartha scoile ar fáil ón gClár Tacaíochta don Churaclam Bunscoile - féach 'Cá háit a dhéanfaidh mé iarratas' thíos
